Tekla Open API Reference for Tekla Structures 2025
Assembly.Remove Method
 Removes the given instance from the assembly. Before removing steel parts from an assembly all connecting workshop welds and bolts must be deleted.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Remove(
	ModelObject Object
)
Public Function Remove (
	Object As ModelObject
) As Boolean
Parameters
Object
Type: Tekla.Structures.Model.ModelObject
The model object to remove from the assembly.
Return Value
Type: Boolean
True if successfully removed.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace